benorose/XunFengzhandui/电控组/STM32_programme/Task_01/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B_IN1_Pin GPIO_PIN_0
#define B_IN1_GPIO_Port GPIOA
#define B_IN2_Pin GPIO_PIN_1
#define B_IN2_GPIO_Port GPIOA
#define B_IN3_Pin GPIO_PIN_2
#define B_IN3_GPIO_Port GPIOA
#define B_IN4_Pin GPIO_PIN_3
#define B_IN4_GPIO_Port GPIOA
#define DAT_Pin GPIO_PIN_4
#define DAT_GPIO_Port GPIOA
#define CMD_Pin GPIO_PIN_5
#define CMD_GPIO_Port GPIOA
#define CS_Pin GPIO_PIN_6
#define CS_GPIO_Port GPIOA
#define CLK_Pin GPIO_PIN_7
#define CLK_GPIO_Port GPIOA
#define Servo_2_Pin GPIO_PIN_8
#define Servo_2_GPIO_Port GPIOA
#define Servo_1_Pin GPIO_PIN_9
#define Servo_1_GPIO_Port GPIOA
#define F_IN1_Pin GPIO_PIN_6
#define F_IN1_GPIO_Port GPIOB
#define F_IN2_Pin GPIO_PIN_7
#define F_IN2_GPIO_Port GPIOB
#define F_IN3_Pin GPIO_PIN_8
#define F_IN3_GPIO_Port GPIOB
#define F_IN4_Pin GPIO_PIN_9
#define F_IN4_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
